hpmicro/hpm_sdk/soc/HPM5E00/HPM5E31/HPM5E31_svd.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CNT_VAL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>main counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>DAC_VALUE_SV[%s]</name>
          <description>no description available</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>save dac0_value when dac0_valid if dac_sw_mode is 0;
software write dac_value directly if dac_sw_mode is 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>CAPTURE_POS[%s]</name>
          <description>no description available</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF13</resetMask>
          <fields>
            <field>
              <name>CAPTURE_POS</name>
              <description>related counter value captured at input negedge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAPTURE_SELGPIO</name>
              <description>0: result from CAP[  7:0],  from trgm
1: result from CAP[15:8],  from gpio</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_INDEX</name>
              <description>related counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>CAPTURE_NEG[%s]</name>
          <description>no description available</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>CAPTURE_NEG</name>
              <description>counter value captured at input negedge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts</name>
          <description>No description available</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x8000003F</resetMask>
          <fields>
            <field>
              <name>IRQ_CAL_OVERFLOW</name>
              <description>end of output burst</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IRQ_BURSTEND</name>
              <description>end of output burst</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRQ_FAULT</name>
              <description>for external fault event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRQ_CAPTURE_NEG</name>
              <description>capture negedge status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRQ_CAPTURE_POS</name>
              <description>capture posedge status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRQ_RELOAD</name>
              <description>when clock counter reach the reload time</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRQ_CMP</name>
              <description>for 24 channel, compare event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_en</name>
          <description>No description available</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>IRQ_EN_OVERFLOW</name>
              <description>enable interrupt when calculation unit overflow</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts_cmp</name>
          <description>No description available</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_STS_CMP</name>
              <description>interrupt flag for compare point match event, and each bit means one compare point.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts_reload</name>
          <description>No description available</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IRQ_STS_RELOAD</name>
              <description>interrupt flag for reload event , and each bit means one main counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts_cap_pos</name>
          <description>No description available</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IRQ_STS_CAP_POS</name>
              <description>interrupt flag for posedge capture event , and each bit means one capture channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts_cap_neg</name>
          <description>No description available</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IRQ_STS_CAP_NEG</name>
              <description>interrupt flag for negedge capture event , and each bit means one capture channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts_fault</name>
          <description>No description available</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IRQ_STS_FAULT</name>
              <description>interrupt flag for external fault event , and each bit means one external fault channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts_burstend</name>
          <description>No description available</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IRQ_STS_BURSTEND</name>
              <description>interrupt flag for output burst done event , and each bit means one main counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_en_cmp</name>
          <description>No description available</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN_CMP</name>
              <description>interrupt enable field for compare point match event, and each bit means one compare point.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_en_reload</name>
          <description>No description available</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IRQ_EN_RELOAD</name>
              <description>interrupt enable field for reload event , and each bit means one main counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_en_cap_pos</name>
          <description>No description available</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN_CAP_POS</name>
              <description>interrupt enable field for posedge capture event , and each bit means one capture channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_en_cap_neg</name>
          <description>No description available</description>
          <addressOffset>0x43c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN_CAP_NEG</name>
              <description>interrupt enable field for negedge capture event , and each bit means one capture channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_en_fault</name>
          <description>No description available</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IRQ_EN_FAULT</name>
              <description>interrupt enable field for external fault event , and each bit means one external fault channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_en_burstend</name>
          <description>No description available</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IRQ_EN_BURSTEND</name>
              <description>interrupt enable field for output burst done event , and each bit means one main counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dma_en</name>
          <description>No description available</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9F9F9F9F</resetMask>
          <fields>
            <field>
              <name>DMA3_EN</name>
              <description>enable dma3</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA3_SEL</name>
              <description>selelct one of compare point(0~23) or one reload point(24~27) as dma0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2_EN</name>
              <description>enable dma2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2_SEL</name>
              <description>selelct one of compare point(0~23) or one reload point(24~27) as dma0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA1_EN</name>
              <description>enable dma1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA1_SEL</name>
              <description>selelct one of compare point(0~23) or one reload point(24~27) as dma0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA0_EN</name>
              <description>enable dma0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA0_SEL</name>
              <description>selelct one of compare point(0~23) or one reload point(24~27) as dma0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CNT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>cfg0</name>
            <description>No description available</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x1F1F731F</resetMask>
            <fields>
              <field>
                <name>RLD_CMP_SEL1</name>
                <description>select one compare point from 24, set to 0x1F to disable current selection, used for reload value, compare value, force value update</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RLD_CMP_SEL0</name>
                <description>select one compare point from 24, set to 0x1F to disable current selection</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RLD_TRIG_SEL</name>
                <description>select one trigger from 8, should set to pulse in trig_mux</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RLD_UPDATE_TIME</name>
                <description>define when to use the calculation output value as reload time
00:  software set work_ctrl1.shadow_lock bit
01:  use compare point selected by rld_cmp_sel0 or rld_cmp_sel1
10:  counter reload time
11:  use rld_trig_sel to select one of the input trigger
NOTE: 00 is not recommended since the update time is not controllable, may cause error in complex application.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_D_PARAM</name>
                <description>input dac data parameter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg1</name>
            <description>No description available</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x039F9F1F</resetMask>
            <fields>
              <field>
                <name>CNT_DAC_INDEX</name>
                <description>select one of the dac value</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_LU_EN</name>
                <description>set to enable up limit, use cnt_lu_off to select one of the shadow register value as limitation</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_LIM_UP</name>
                <description>up limit offset selection, from one of the shadow_val</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_LL_EN</name>
                <description>set to enable low limit</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_LIM_LO</name>
                <description>low limit offset selection, from one of the shadow_val</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_IN_OFF</name>
                <description>input data offset selection, from one of the shadow_val, default just shadow reload time</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
