hpmicro/hpm_sdk/soc/HPM5E00/HPM5E31/HPM5E31_svd.xml
          <register>
            <name>HOMING_CFG</name>
            <description>Homing Configuration Register</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RNG_CMP_SRC</name>
                <description>Select Compare Source for Comparator 0 in Range Match mode ( Mode1 )：
0: Compare value from counter (Line+Phase), compare when counter updates
1: Compare value from counter (Revolution+Line+Phase),  compare when counter updates
2: Compare value from tacho_line(16bits), compare after each tacho
3: Compare value from tacho_time(16bits), compare after each tacho</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MATCH0_MODE</name>
                <description>Match Mode for Match0:
Mode0 : Disable.
Mode1 : Range Match:
If  CMP0 &lt;= CMP1, match valid when CMP0 &lt;= RNG_CMP_SRC &lt;= CMP1;
If CMP0 &gt; CMP1, match valid when CMP0 &lt;= RNG_CMP_SRC or RNG_CMP_SRC &lt;= CMP1;
Note: The interrupt will be only available when entry and exit compare, i.e., it is generated only twice, but you can check whether it matches or not through the status bit in register.
Mode2 : when the COUNTER value matches the CMP0;
Mode3 : when the COUNTER value matches the CMP0; and the direction update value should be the same as the current direction;
Mode4: when counting up, the COUNTER value matches the CMP0;
Mode5: when counting up, the COUNTER value matches the CMP0; and the direction update value should be the same as the current direction;
Mode6: when counting down, the COUNTER value matches the CMP0;
Mode7: when counting down, the COUNTER value matches the CMP0; and the direction update value should be the same as the current direction;
Direction update value: direction decoded by the decoder according to the Phase (e.g. Phase 0 -&gt; 1 -&gt; 2 -&gt; 3 -&gt; 4 -&gt; 5 -&gt; 0 ...... mean forward.
Current Direction: direction decoded by the comparator based on the line field in counter.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DMODE</name>
                <description>Dump Mode Selection
0：Disable
1：Edge Mode(Use Edge in DSTATE Register)
2：Level Mode(Match Phase A,B and H)
3：Level Mode(Only Match Phase H)</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTATE</name>
                <description>Dump Match State
When level mode:
The remaining bits correspond to the level state of the HZBA phase, respectively.
When edge mode:
Bit3: H-phase rising edge, reverse
Bit2: H-phase falling edge, forward
Bit1: H-phase falling edge, reverse
Bit0: H-phase rising edge, forward.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HMODE</name>
                <description>Phase H Mode Selection
0：Disable
1：Edge Mode(Use Edge in HSTATE Register)
2：Level Mode(Match Phase A,B and H)
3：Level Mode(Only Match Phase H)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HSTATE</name>
                <description>H-Phase Match State
When level mode:
Each bit correspond to the level state of the HZBA phase, respectively.
When edge mode:
If bit3 is 1: Match H-phase rising edge, reverse
If bit2 is 1: Match H-phase falling edge, forward
If bit1 is 1: Match H-phase falling edge, reverse
If bit0 is 1: Match H-phase rising edge, forward.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ANALYSE_CFG</name>
            <description>Analyse Configuration Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ERS</name>
                <description>Whether to discard this result and automatically restart the tacho immediately after a Dec_Error or Seq_Error is detected.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TACHO_MODE</name>
                <description>Tacho Mode Selection
0: Disable tacho
1: Period Mode, specify the length of time, measure the number of complete lines traveled within the length of time, and record the actual time spent.
2: Travel Mode, specify the number of lines, measure the time taken to reach the number of lines.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TACHO_LEN</name>
                <description>Tacho Length
Period Mode：specify the length of time for each tacho.
Travel  Mode：specify the number of lines for each tacho.
Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIRECTION</name>
            <description>Direction Configuration Register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DIR</name>
                <description>Software Override Direction Value
0： Forward
1： Reverse</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMP0</name>
            <description>Compare0 Configuration Register</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMP0</name>
                <description>Comnpare Point 0
Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMP1</name>
            <description>Compare1 Configuration Register</description>
            <addressOffset>0x1c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMP1</name>
                <description>Comnpare Point 1
Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT</name>
            <description>Counter Register</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COUNTER</name>
                <description>Pulse Counter Value
Note:
1. Pulse Counter Value update when:
- Software Update: According to the current DECODE_MODE, the software directly writes the target value to the Revolution field and Line field of this register;
- Phase Z (Index) match: When Phase Z matches, clear Line field; Revolution field will be increased by 1 if forward, Revolution field remains unchanged if reverse, and the Phase field will be updated by decoder.
- Phase H (Home) match: when Phase H matches, clear Revolution field; and the Line field and Phase field will be updated by decoder.
- Decoder update: Revolution field, Line field and Phase field will be updated by decoder.
2. This is a SYNC register, and it won't be valid immediately after software write. It can be change only after last configuration valid.
3. Pulse Counter Value include：
- Revolution field;
- Line field，the width of this bit field depends on RESOLUTION register;
- Phase field，the width of this bit field depends on DECODE_MODE register, when:
·  MODE_AB_4X: 2 Bits，Bit[1:0];
·  MODE_AB_2X: 1 Bit，Bit[0];
·  MODE_AB_1X: 0 Bit，no Phase field;
·  MODE_PD_1X: 0 Bit，no Phase field;
·  MODE_PDF1X: 0 Bit，no Phase field;
·  MODE_PD_2X: 1 Bit，Bit[0]；
·  MODE_PDF2X: 1 Bit，Bit[0];
·  MODE_UD_1X: 0 Bit，no Phase field;
·  MODE_UDF1X: 0 Bit，no Phase field;
·  MODE_UD_2X: 1 Bit，Bit[0];
·  MODE_UDF2X: 1 Bit，Bit[0];
·  MODE_UVW6X: 3 Bits，Bit[2:0];
·  MODE_UVW6Y: 3 Bits，Bit[2:0];</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TACHO</name>
            <description>Tacho Register</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LINE</name>
                <description>Line Result
Period Mode：count up from 0 when forward; count down from 0 when forward.
Travel  Mode：count up from 0 when forward; count down from 0xFFFF when forward.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TIME</name>
                <description>Time Result
Period Mode: The actual time taken to complete the complete Lines in a specified time.
Travel Mode: The actual time taken to complete the specified Lines.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DUMP</name>
            <description>DUMP Register</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DUMP</name>
                <description>Dump Result:  Save COUNTER value when DUMP match.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STS</name>
            <description>Status Register</description>
            <addressOffset>0x2c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MATCH0</name>
                <description>MATCH0 Status
0:invalid
1:valid</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
